cf/DataProcessors/_DemoDeferredUpdateManagement.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>_DemoDeferredUpdateManagement</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/UpdateHandlers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>UpdateHandlers</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.UpdateHandlersStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LibraryName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DataRegistrationDuration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ProcessingDuration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExecutionMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HandlersExecutionModes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OrderOfUpdateHandlers</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>RegistrationVersion</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VersionOrder</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AttemptCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExecutionStatistics</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ErrorInfo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Priority</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckProcedure</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateDataFillingProcedure</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeferredProcessingQueue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExecuteInMasterNodeOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RunAlsoInSubordinateDIBNodeWithFilters</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multithreaded</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BatchProcessingCompleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateGroup</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartIteration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataToProcess</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeferredHandlerExecutionMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DeferredHandlersExecutionModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectsToChange</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsSeveritySeparationUsed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsUpToDateDataProcessed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>HandlerName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/UpdateHandlersStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>UpdateHandlersStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Completed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotPerformed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Running</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Paused</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/_DemoPartners.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>_DemoPartners</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Competitor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtherRelations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoPartnersAccessGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartnerKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef._DemoBusinessEntityIndividual</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>State</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KindForList</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/_DemoCounterpartiesContracts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>_DemoCounterpartiesContracts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog._DemoCounterparties</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ContractNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractDate_</Name>
					<Comment>Date of agreement</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Partner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoPartners</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Comment>Determines the currency of Settlements under the contract, cannot be changed if at least one document is carried out under the contract</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidityStartDate</Name>
					<Comment>Start date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidityEndDate</Name>
					<Comment>Expiration date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/_DemoDeferredUpdateManagement/Forms/Form/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormCommandsEventHandlers

&AtClient
Procedure Generate(Command)
	GenerateOrdersAtServer();
EndProcedure

&AtClient
Procedure CloseForm(Command)
	Close();
EndProcedure

&AtClient
Procedure ClearChanges(Command)
	ResetChangesAtServer();
EndProcedure

&AtClient
Procedure OpenDeferredUpdateStartForm(Command)
	OpenForm("DataProcessor.ApplicationUpdateResult.Form.ApplicationUpdateResult");
EndProcedure

&AtClient
Procedure ClearUpdateInformation(Command)
	
	ResetUpdateInfoAtServer();
	
EndProcedure

&AtClient
Procedure LockObject(Command)
	LockObjectAtServer();
EndProcedure

&AtClient
Procedure AddErrorOnDeferredUpdate(Command)
	
	AddErrorAtServer();
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure AddErrorAtServer()
	
	Common.CommonSettingsStorageSave("DeferredIBUpdate", "SimulateError", True,, UserName());
	
EndProcedure

&AtServer
Procedure GenerateOrdersAtServer()
	
	// Get currencies.
	Query = New Query;
	Query.Text = 
	"SELECT
	|	Currencies.Ref AS Ref
	|FROM
	|	Catalog.Currencies AS Currencies";
	Currencies = Query.Execute().Unload();
	
	// Get a company.
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	Companies.Ref AS Ref
	|FROM
	|	Catalog._DemoCompanies AS Companies";
	Companies = Query.Execute().Unload();
	
	// Get a partner.
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	_DemoPartners.Ref
	|FROM
	|	Catalog._DemoPartners AS _DemoPartners";
	Partners = Query.Execute().Unload();
	
	// Get a counterparty.
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	_DemoCounterparties.Ref
	|FROM
	|	Catalog._DemoCounterparties AS _DemoCounterparties";
	Counterparties = Query.Execute().Unload();
	
	// Get contracts.
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	_DemoCounterpartiesContracts.Ref
	|FROM
	|	Catalog._DemoCounterpartiesContracts AS _DemoCounterpartiesContracts";
	Contracts = Query.Execute().Unload();
	
	DeliveryAddress = "<ContactInformation xmlns=""http://www.v8.1c.ru/ssl/contactinfo"""
		+ " xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"""
		+ " Presentation=""127434, MOSCOW g, Dmitrovskoe motorway, house № 9""><Comment/><Content xsi:type=""Address"""
		+ " Country=""RUSSIA""><Content xsi:type=""LocalAddress""><TerritorialEntity>MOSCOW g</TerritorialEntity><County/><MunicipalEntityDistrictProperty><District/>"
		+ "</MunicipalEntityDistrictProperty><City/><Settlmnt/><Street>Dmitrovskoe motorway</Street><MUNICIPALTERRITORIESCLASSIFIER>0</MUNICIPALTERRITORIESCLASSIFIER><AddlAddressItem><Number Type=""1010"""
		+ " Value=""9""/></AddlAddressItem><AddlAddressItem AddressItemType2=""10100000"" Value=""127434""/></Content></Content></ContactInformation>";
	
	IndexOf = 1;
	BeginTransaction();
	Try
		While IndexOf <= OrdersCount Do
			NewDoc = Documents._DemoSalesOrder.CreateDocument();
			IndexOf = IndexOf + 1;
			NewDoc.Date = CreationDate;
			NewDoc.DeleteOrderClosed = OrderClosed;
			NewDoc.Posted = OrderPosted;
			
			RNG = New RandomNumberGenerator;
			NewDoc.Currency = Currencies.Get(RNG.RandomNumber(0, Currencies.Count() - 1)).Ref;
			NewDoc.Organization = Companies.Get(0).Ref;
			NewDoc.Partner = Partners.Get(0).Ref;
			NewDoc.Counterparty = Counterparties.Get(0).Ref;
			NewDoc.Contract = Contracts.Get(0).Ref;
			NewDoc.DocumentAmount = RNG.RandomNumber(100, 1000);
			NewDoc.Comment = NStr("ru = 'Комментарий документа';
										|en = 'Document comment';");
			
			NewDoc.DeliveryAddress = DeliveryAddress;
			NewDoc.DeliveryAddressString = "";
			
			NewDoc.Write();
		EndDo;
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure

&AtServer
Procedure ResetChangesAtServer()
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	_DemoSalesOrder.Ref AS Ref
	|FROM
	|	Document._DemoSalesOrder AS _DemoSalesOrder";
	Result = Query.Execute().Unload();
	
	DeliveryAddress = "<ContactInformation xmlns=""http://www.v8.1c.ru/ssl/contactinfo"""
		+ " xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"""
		+ " Presentation=""127434, MOSCOW g, Dmitrovskoe motorway, house № 9""><Comment/><Content xsi:type=""Address"""
		+ " Country=""RUSSIA""><Content xsi:type=""LocalAddress""><TerritorialEntity>MOSCOW g</TerritorialEntity><County/><MunicipalEntityDistrictProperty><District/>"
		+ "</MunicipalEntityDistrictProperty><City/><Settlmnt/><Street>Dmitrovskoe motorway</Street><MUNICIPALTERRITORIESCLASSIFIER>0</MUNICIPALTERRITORIESCLASSIFIER><AddlAddressItem><Number Type=""1010"""
		+ " Value=""9""/></AddlAddressItem><AddlAddressItem AddressItemType2=""10100000"" Value=""127434""/></Content></Content></ContactInformation>";
	
	For Each DocumentRef In Result Do
		BeginTransaction();
		Try
			Block = New DataLock;
			LockItem = Block.Add("Document._DemoSalesOrder");
			LockItem.SetValue("Ref", DocumentRef.Ref);
			Block.Lock();
			
			DocumentObject = DocumentRef.Ref.GetObject();
			DocumentObject.DataExchange.Load = True;
			DocumentObject.OrderStatus = Enums._DemoCustomerOrderStatuses.EmptyRef();
			DocumentObject.DeliveryAddress = DeliveryAddress;
			DocumentObject.DeliveryAddressString = "";
			DocumentObject.Write();
			
			CommitTransaction();
		Except
			RollbackTransaction();
			Raise;
		EndTry;
	EndDo;
	
EndProcedure

&AtServer
Procedure ResetUpdateInfoAtServer()
	
	UpdateInfo = InfobaseUpdateInternal.InfobaseUpdateInfo();
	
	UpdateInfo.SessionNumber = New ValueList;
	UpdateInfo.DeferredUpdateStartTime = Undefined;
	UpdateInfo.DeferredUpdatesEndTime = Undefined;
	UpdateInfo.DeferredUpdateCompletedSuccessfully = Undefined;
	Constants.DeferredUpdateCompletedSuccessfully.Set(False);
	
	InfobaseUpdateInternal.WriteInfobaseUpdateInfo(UpdateInfo);
	
	BeginTransaction();
	Try
		Block = New DataLock;
		Block.Add("InformationRegister.UpdateHandlers");
		Block.Lock();
		
		SetOfHandlers = InformationRegisters.UpdateHandlers.CreateRecordSet();
		SetOfHandlers.Read();
		For Each Handler In SetOfHandlers Do
			Handler.Status = Enums.UpdateHandlersStatuses.NotPerformed;
		EndDo;
		SetOfHandlers.Write();
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
	LockedObjectsInfo = InfobaseUpdateInternal.LockedObjectsInfo();
	Handlers = LockedObjectsInfo.Handlers;
	For Each KeyAndValue In Handlers Do
		KeyAndValue.Value.Completed = False;
	EndDo;
	InfobaseUpdateInternal.WriteLockedObjectsInfo(LockedObjectsInfo);
	
	InfobaseUpdateInternal.ReregisterDataForDeferredUpdate();
	
EndProcedure

&AtServer
Procedure LockObjectAtServer()
	
	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	_DemoSalesOrder.Ref AS Ref
	|FROM
	|	Document._DemoSalesOrder AS _DemoSalesOrder
	|WHERE
	|	_DemoSalesOrder.OrderStatus = VALUE(Enum._DemoCustomerOrderStatuses.EmptyRef)";
	
	Result = Query.Execute().Unload();
	For Each BuyerSOrder In Result Do
		BeginTransaction();
		Try
			Block = New DataLock;
			LockItem = Block.Add("Document._DemoSalesOrder");
			LockItem.SetValue("Ref", BuyerSOrder.Ref);
			Block.Lock();
			
			NewDate = CurrentSessionDate() + 10*60;
			While NewDate >= CurrentSessionDate() Do
				// Lock a document for 10 minutes.
			EndDo;
			
			CommitTransaction();
		Except
			RollbackTransaction();
			Raise;
		EndTry;
	EndDo;
	
EndProcedure

#EndRegion
